lib/tasks/users.rake

INSERT INTO "users" ("name", "email", "gender", "phone", "nickname", "cpf", "city", "state", "search_range", "zipcode", "street", "street_number", "neighborhood", "complement", "created_by_business", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  task import: :environment do
    CSV.foreach('users.csv', headers: true) do |row|
      @user = user_find_or_initialize_by(row.to_hash)

      unless @user.persisted?
        if @user.save(validate: false)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "beautyane.date@hotmail.com"], ["LIMIT", 1]]
---
  def user_find_or_initialize_by(params)
    user = User.find_by(email: params['email']) || User.find_by(cpf: params['cpf']) || User.find_by(phone: params['phone'])