app/controllers/users_controller.rb

  def create
    @user = User.new user_params
    @user.source = 'web'

    if @user.valid? && @user.save
      sign_in @user
      render jsonapi: @user
    else
      existing_user ||= User.check_existence_by_email_or_phone(@user.try(:email), @user.try(:phone).try(:value)).first
      if check_errors_params(@user) && existing_user.present?
---
INSERT INTO "users" ("name", "email", "encrypted_password", "phone", "created_at", "updated_at", "provider") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "lu-lpr@hotmail.com"], ["LIMIT", 1]]